## production: ses_to_sqs_email_callbacks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| delete | `aws_lambda_permission.allow_sns_ses_callbacks`                |
|        | `aws_sns_topic_subscription.ses_sns_to_lambda`                 |
| update | `module.ses_to_sqs_email_callbacks.aws_iam_policy.policies[0]` |
| add    | `aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
14:48:28.061 STDOUT terraform:   + create
14:48:28.061 STDOUT terraform:   ~ update in-place
14:48:28.061 STDOUT terraform:   - destroy
14:48:28.061 STDOUT terraform: Terraform will perform the following actions:
14:48:28.061 STDOUT terraform:   # aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger will be created
14:48:28.061 STDOUT terraform:   + resource "aws_lambda_event_source_mapping" "sqs_batch_callbacks_trigger" {
14:48:28.061 STDOUT terraform:       + arn                                = (known after apply)
14:48:28.061 STDOUT terraform:       + batch_size                         = 10
14:48:28.061 STDOUT terraform:       + enabled                            = true
14:48:28.061 STDOUT terraform:       + function_arn                       = (known after apply)
14:48:28.062 STDOUT terraform:       + function_name                      = "ses_to_sqs_email_callbacks"
14:48:28.062 STDOUT terraform:       + id                                 = (known after apply)
14:48:28.062 STDOUT terraform:       + last_modified                      = (known after apply)
14:48:28.062 STDOUT terraform:       + last_processing_result             = (known after apply)
14:48:28.062 STDOUT terraform:       + maximum_batching_window_in_seconds = 1
14:48:28.062 STDOUT terraform:       + maximum_record_age_in_seconds      = (known after apply)
14:48:28.062 STDOUT terraform:       + maximum_retry_attempts             = (known after apply)
14:48:28.062 STDOUT terraform:       + parallelization_factor             = (known after apply)
14:48:28.062 STDOUT terraform:       + state                              = (known after apply)
14:48:28.062 STDOUT terraform:       + state_transition_reason            = (known after apply)
14:48:28.062 STDOUT terraform:       + tags_all                           = (known after apply)
14:48:28.062 STDOUT terraform:       + uuid                               = (known after apply)
14:48:28.062 STDOUT terraform:         # (1 unchanged attribute hidden)
14:48:28.062 STDOUT terraform:       + amazon_managed_kafka_event_source_config (known after apply)
14:48:28.062 STDOUT terraform:       + self_managed_kafka_event_source_config (known after apply)
14:48:28.062 STDOUT terraform:     }
14:48:28.062 STDOUT terraform:   # aws_lambda_permission.allow_sns_ses_callbacks will be destroyed
14:48:28.062 STDOUT terraform:   # (because aws_lambda_permission.allow_sns_ses_callbacks is not in configuration)
14:48:28.062 STDOUT terraform:   - resource "aws_lambda_permission" "allow_sns_ses_callbacks" {
14:48:28.062 STDOUT terraform:       - action              = "lambda:InvokeFunction" -> null
14:48:28.062 STDOUT terraform:       - function_name       = "ses_to_sqs_email_callbacks" -> null
14:48:28.062 STDOUT terraform:       - id                  = "terraform-20230209143550202300000001" -> null
14:48:28.062 STDOUT terraform:       - principal           = "sns.amazonaws.com" -> null
14:48:28.063 STDOUT terraform:       - source_arn          = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
14:48:28.063 STDOUT terraform:       - statement_id        = "terraform-20230209143550202300000001" -> null
14:48:28.063 STDOUT terraform:       - statement_id_prefix = "terraform-" -> null
14:48:28.063 STDOUT terraform:         # (1 unchanged attribute hidden)
14:48:28.063 STDOUT terraform:     }
14:48:28.063 STDOUT terraform:   # aws_sns_topic_subscription.ses_sns_to_lambda will be destroyed
14:48:28.063 STDOUT terraform:   # (because aws_sns_topic_subscription.ses_sns_to_lambda is not in configuration)
14:48:28.063 STDOUT terraform:   - resource "aws_sns_topic_subscription" "ses_sns_to_lambda" {
14:48:28.063 STDOUT terraform:       - arn                             = "arn:aws:sns:ca-central-1:296255494825:ses-callback:c498cf6e-1837-4105-a75b-7b0cb28c7b00" -> null
14:48:28.063 STDOUT terraform:       - confirmation_timeout_in_minutes = 1 -> null
14:48:28.063 STDOUT terraform:       - confirmation_was_authenticated  = true -> null
14:48:28.063 STDOUT terraform:       - endpoint                        = "arn:aws:lambda:ca-central-1:296255494825:function:ses_to_sqs_email_callbacks" -> null
14:48:28.063 STDOUT terraform:       - endpoint_auto_confirms          = false -> null
14:48:28.063 STDOUT terraform:       - id                              = "arn:aws:sns:ca-central-1:296255494825:ses-callback:c498cf6e-1837-4105-a75b-7b0cb28c7b00" -> null
14:48:28.063 STDOUT terraform:       - owner_id                        = "296255494825" -> null
14:48:28.063 STDOUT terraform:       - pending_confirmation            = false -> null
14:48:28.063 STDOUT terraform:       - protocol                        = "lambda" -> null
14:48:28.063 STDOUT terraform:       - raw_message_delivery            = false -> null
14:48:28.063 STDOUT terraform:       - topic_arn                       = "arn:aws:sns:ca-central-1:296255494825:ses-callback" -> null
14:48:28.063 STDOUT terraform:         # (6 unchanged attributes hidden)
14:48:28.063 STDOUT terraform:     }
14:48:28.063 STDOUT terraform:   # module.ses_to_sqs_email_callbacks.aws_iam_policy.policies[0] will be updated in-place
14:48:28.063 STDOUT terraform:   ~ resource "aws_iam_policy" "policies" {
14:48:28.063 STDOUT terraform:         id               = "arn:aws:iam::296255494825:policy/ses_to_sqs_email_callbacks-0"
14:48:28.063 STDOUT terraform:         name             = "ses_to_sqs_email_callbacks-0"
14:48:28.063 STDOUT terraform:       ~ policy           = jsonencode(
14:48:28.063 STDOUT terraform:           ~ {
14:48:28.063 STDOUT terraform:               ~ Statement = [
14:48:28.063 STDOUT terraform:                   ~ {
14:48:28.064 STDOUT terraform:                       - Sid      = ""
14:48:28.064 STDOUT terraform:                         # (3 unchanged attributes hidden)
14:48:28.064 STDOUT terraform:                     },
14:48:28.064 STDOUT terraform:                   + {
14:48:28.064 STDOUT terraform:                       + Action   = [
14:48:28.064 STDOUT terraform:                           + "sqs:ReceiveMessage",
14:48:28.064 STDOUT terraform:                           + "sqs:GetQueueAttributes",
14:48:28.064 STDOUT terraform:                           + "sqs:DeleteMessage",
14:48:28.064 STDOUT terraform:                         ]
14:48:28.064 STDOUT terraform:                       + Effect   = "Allow"
14:48:28.064 STDOUT terraform:                       + Resource = ""
14:48:28.064 STDOUT terraform:                     },
14:48:28.064 STDOUT terraform:                 ]
14:48:28.064 STDOUT terraform:                 # (1 unchanged attribute hidden)
14:48:28.064 STDOUT terraform:             }
14:48:28.064 STDOUT terraform:         )
14:48:28.064 STDOUT terraform:         tags             = {
14:48:28.064 STDOUT terraform:             "CostCentre" = "notification-canada-ca-production"
14:48:28.064 STDOUT terraform:             "Terraform"  = "true"
14:48:28.064 STDOUT terraform:         }
14:48:28.064 STDOUT terraform:         # (7 unchanged attributes hidden)
14:48:28.064 STDOUT terraform:     }
14:48:28.064 STDOUT terraform: Plan: 1 to add, 1 to change, 2 to destroy.
14:48:28.064 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
14:48:28.064 STDOUT terraform: Saved the plan to: plan.tfplan
14:48:28.064 STDOUT terraform: To perform exactly these actions, run the following command to apply:
14:48:28.064 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ses_to_sqs_email_callbacks_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-ses-delivery-receipts-errors-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-ses_to_sqs_email_callbacks-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-ses_to_sqs_email_callbacks-500-errors-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_event_source_mapping.sqs_batch_callbacks_trigger"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
